# 01_pandas_basics.py - Основы Pandas

import pandas as pd
import numpy as np

print("="*60)
print("ОСНОВЫ Pandas")
print("="*60)

# ==========================================
# SERIES - ОДНОМЕРНЫЕ ДАННЫЕ
# ==========================================

print("\n1. Series (одномерные данные):")

# Создать из списка
s = pd.Series([10, 20, 30, 40, 50])
print(f"\nSeries из списка:\n{s}")
"""
0    10
1    20
2    30
3    40
4    50
dtype: int64

Слева - индекс (автоматически 0, 1, 2...)
Справа - значения
"""

# С явным индексом
s2 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(f"\nSeries с индексом:\n{s2}")
"""
a    10
b    20
c    30
"""

# Из словаря
s3 = pd.Series({'Москва': 12_000_000, 'СПб': 5_000_000, 'Казань': 1_200_000})
print(f"\nSeries из словаря:\n{s3}")

# Доступ к элементам
print(f"\ns3['Москва'] = {s3['Москва']}")
print(f"s3.iloc[0] = {s3.iloc[0]}")  # По индексу позиции
"""
.loc[] - доступ по метке (имени)
.iloc[] - доступ по позиции (числу)
"""

# Операции
print(f"\ns3 / 1_000_000 (в миллионах):\n{s3 / 1_000_000}")

# Фильтрация
print(f"\nГорода > 2 млн:\n{s3[s3 > 2_000_000]}")

# ==========================================
# DATAFRAME - ТАБЛИЦЫ
# ==========================================

print("\n" + "="*60)
print("2. DataFrame (таблицы):")
print("="*60)

# Создать из словаря
data = {
    'Имя': ['Иван', 'Мария', 'Пётр', 'Анна', 'Сергей'],
    'Возраст': [25, 30, 28, 35, 22],
    'Город': ['Москва', 'СПб', 'Казань', 'Москва', 'СПб'],
    'Зарплата': [50000, 60000, 45000, 70000, 40000]
}

df = pd.DataFrame(data)
print(f"\nDataFrame:\n{df}")
"""
      Имя  Возраст    Город  Зарплата
0    Иван       25   Москва     50000
1   Мария       30      СПб     60000
2    Пётр       28   Казань     45000
3    Анна       35   Москва     70000
4  Сергей       22      СПб     40000
"""

# Информация о DataFrame
print(f"\nФорма (строки, столбцы): {df.shape}")
print(f"Столбцы: {df.columns.tolist()}")
print(f"Индекс: {df.index.tolist()}")
print(f"Типы данных:\n{df.dtypes}")

# Первые/последние строки
print(f"\nПервые 3 строки:\n{df.head(3)}")
print(f"\nПоследние 2 строки:\n{df.tail(2)}")

# Статистика
print(f"\nСтатистика:\n{df.describe()}")
"""
describe() - статистика для числовых столбцов:
- count - количество
- mean - среднее
- std - стандартное отклонение
- min, max - минимум, максимум
- 25%, 50%, 75% - квартили
"""

# Информация
print("\nИнформация о DataFrame:")
df.info()

# ==========================================
# ДОСТУП К ДАННЫМ
# ==========================================

print("\n" + "="*60)
print("3. Доступ к данным:")
print("="*60)

# Один столбец (Series)
print(f"\nСтолбец 'Имя':\n{df['Имя']}")

# Несколько столбцов (DataFrame)
print(f"\nСтолбцы 'Имя' и 'Зарплата':\n{df[['Имя', 'Зарплата']]}")

# Одна строка
print(f"\nСтрока 0:\n{df.loc[0]}")
print(f"\nСтрока 0 (по позиции):\n{df.iloc[0]}")

# Диапазон строк
print(f"\nСтроки 1-3:\n{df.loc[1:3]}")
print(f"\nСтроки 1-3 (по позиции, не включая 3):\n{df.iloc[1:3]}")

# Конкретная ячейка
print(f"\ndf.loc[0, 'Имя'] = {df.loc[0, 'Имя']}")
print(f"df.iloc[0, 0] = {df.iloc[0, 0]}")

# Срезы
print(f"\nСтроки 1-3, столбцы 'Имя' и 'Возраст':\n{df.loc[1:3, ['Имя', 'Возраст']]}")

# ==========================================
# ДОБАВЛЕНИЕ/УДАЛЕНИЕ СТОЛБЦОВ
# ==========================================

print("\n" + "="*60)
print("4. Добавление/удаление столбцов:")
print("="*60)

# Добавить новый столбец
df['Бонус'] = df['Зарплата'] * 0.1
print(f"\nДобавлен столбец 'Бонус':\n{df}")

# Добавить константу
df['Страна'] = 'Россия'
print(f"\nДобавлен столбец 'Страна':\n{df[['Имя', 'Страна']]}")

# Вычисляемый столбец
df['Доход'] = df['Зарплата'] + df['Бонус']
print(f"\nДобавлен столбец 'Доход':\n{df[['Имя', 'Зарплата', 'Бонус', 'Доход']]}")

# Удалить столбец
df_copy = df.copy()
df_copy = df_copy.drop('Бонус', axis=1)
"""
axis=0 - строки
axis=1 - столбцы
"""
print(f"\nУдалён столбец 'Бонус':\n{df_copy.columns.tolist()}")

# Удалить несколько столбцов
df_copy = df.drop(['Бонус', 'Доход', 'Страна'], axis=1)
print(f"\nОстались столбцы:\n{df_copy.columns.tolist()}")

# ==========================================
# ДОБАВЛЕНИЕ/УДАЛЕНИЕ СТРОК
# ==========================================

print("\n" + "="*60)
print("5. Добавление/удаление строк:")
print("="*60)

# Добавить строку
new_row = pd.DataFrame({
    'Имя': ['Ольга'],
    'Возраст': [27],
    'Город': ['Казань'],
    'Зарплата': [55000],
    'Бонус': [5500],
    'Страна': ['Россия'],
    'Доход': [60500]
})

df_new = pd.concat([df, new_row], ignore_index=True)
"""
pd.concat() - объединить DataFrame'ы
ignore_index=True - пересоздать индекс (0, 1, 2...)
"""
print(f"\nДобавлена строка:\n{df_new}")

# Удалить строку
df_dropped = df.drop(0)  # Удалить строку с индексом 0
print(f"\nУдалена строка 0:\n{df_dropped}")

# Удалить несколько строк
df_dropped = df.drop([0, 2])
print(f"\nУдалены строки 0 и 2:\n{df_dropped}")

# ==========================================
# ФИЛЬТРАЦИЯ
# ==========================================

print("\n" + "="*60)
print("6. Фильтрация данных:")
print("="*60)

# Простое условие
print(f"\nВозраст > 25:\n{df[df['Возраст'] > 25]}")

# Несколько условий (И)
print(f"\nВозраст > 25 И Город = Москва:\n{df[(df['Возраст'] > 25) & (df['Город'] == 'Москва')]}")
"""
& - логическое И (and)
| - логическое ИЛИ (or)
~ - логическое НЕ (not)

ВАЖНО: скобки обязательны!
"""

# ИЛИ
print(f"\nВозраст < 25 ИЛИ Зарплата > 60000:\n{df[(df['Возраст'] < 25) | (df['Зарплата'] > 60000)]}")

# isin() - принадлежность списку
print(f"\nГород в [Москва, СПб]:\n{df[df['Город'].isin(['Москва', 'СПб'])]}")

# between() - диапазон
print(f"\nВозраст от 25 до 30:\n{df[df['Возраст'].between(25, 30)]}")

# ==========================================
# СОРТИРОВКА
# ==========================================

print("\n" + "="*60)
print("7. Сортировка:")
print("="*60)

# По одному столбцу
print(f"\nПо возрасту (возрастание):\n{df.sort_values('Возраст')}")

# По убыванию
print(f"\nПо зарплате (убывание):\n{df.sort_values('Зарплата', ascending=False)}")

# По нескольким столбцам
print(f"\nПо городу, затем по зарплате:\n{df.sort_values(['Город', 'Зарплата'])}")

# Сортировка индекса
df_sorted = df.sort_values('Возраст')
print(f"\nПосле сортировки индекс:\n{df_sorted.index.tolist()}")

# Сбросить индекс
df_sorted = df_sorted.reset_index(drop=True)
print(f"\nПосле reset_index():\n{df_sorted}")

print("\n" + "="*60)
print("ИТОГИ:")
print("="*60)
print("""
Pandas основы:

Series:
- pd.Series([1, 2, 3]) - создать
- s['label'] - доступ по метке
- s.iloc[0] - доступ по позиции

DataFrame:
- pd.DataFrame(dict) - создать
- df.shape - размер
- df.head() - первые строки
- df.info() - информация
- df.describe() - статистика

Доступ:
- df['column'] - столбец
- df[['col1', 'col2']] - несколько столбцов
- df.loc[0] - строка по метке
- df.iloc[0] - строка по позиции

Фильтрация:
- df[df['Age'] > 25] - условие
- df[(condition1) & (condition2)] - И
- df[(condition1) | (condition2)] - ИЛИ
- df[df['City'].isin(['Moscow'])] - в списке

Операции:
- df.sort_values('column') - сортировка
- df.drop('column', axis=1) - удалить столбец
- pd.concat([df1, df2]) - объединить
""")